//電腦的世界是用什麼進位制？
//二進位
//儲存與金錢相關的資料時應該用哪種類型？為什麼？
//Decamal,因為需要精確計算
//下列敘述紫色部分有一個是錯的，請改成正確的敘述。
//任何十進位可以精準表達的整數和小數都可以精準轉換成二進位數字；
//任何二進位可以精準表達的整數和小數都可以精準轉換成十進位數字。
//任何十進位可以精準表達的整數都可以精準轉換成二進位數字
//請問以下兩個十進位數字可以精準的被存入 Double 中嗎？
//數字 A：12345678901234567
//數字 B：12345687890000000000
//數字A不行數字B可以,因為數字A超過decimal能正確表達的連續數字(16),數字B只有10個連續數字


// 【ChaoCode】 Swift 基礎篇 3：數字類型實作作業
import Foundation
// 1. 請把台幣 975,772 元轉換成日幣，匯率是 1 台幣等於 3.95 日幣。
let NTD = Decimal(string : "975772")!
let JPY = NTD * Decimal(string: "3.95")!

print("台幣 \(NTD) 元等於日幣 \(JPY) 元。")


// 2. 請印出十進位的 90000.23 用 Double 儲存會產生的誤差值。
// 答案可以是正數或負數，只要數字部分正確即可。

let decimal = Decimal(string: "90000.23")! // 精確的decimal
let doubleToDecimal = Decimal(90000.23)    // 不精確的decimal
let diff = decimal - doubleToDecimal

print("90000.23 用 Double 儲存會產生的誤差值為：\(diff)。")
